print("x y z w")
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if  () == False: #False Если F (0;0;0;0)
                   print(x, y, z, w)

                   #Правила
                   #Инверсия ака приставка (not) логическое отрицание
                   #Конъюнкция ака домик (and) логическое умножение
                   #Дизъюнкция ака перевернутый дом (or) логическое сложение
                   #Имликация ака длинная стрелка (<=) логическое равносильность